DataProcessors/ЗаполнитьUID_ДляИнструментовБезUID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнитьUID_ДляИнструментовБезUID</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФондETF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Валюта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтруктурныйПродукт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опцион</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индекс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Инструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Инструменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тикер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЛота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FIGI</Name>
					<Comment>Financial Instrument Global Identifier</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>classCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаполнитьUID_ДляИнструментовБезUID/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	Состояние("Выполняется заполнение реквизитов...");
	ПолучитьУИДы();
КонецПроцедуры

&НаСервере
Процедура ПолучитьУИДы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Инструменты.Ссылка КАК Ссылка,
		|	ВЫБОР Инструменты.ТипИнструмента
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.НеОпределено)
		|			ТОГДА ""INSTRUMENT_TYPE_UNSPECIFIED""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Облигация)
		|			ТОГДА ""INSTRUMENT_TYPE_BOND""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Акция)
		|			ТОГДА ""INSTRUMENT_TYPE_SHARE""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Валюта)
		|			ТОГДА ""INSTRUMENT_TYPE_CURRENCY""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.ФондETF)
		|			ТОГДА ""INSTRUMENT_TYPE_ETF""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Фьючерс)
		|			ТОГДА ""INSTRUMENT_TYPE_FUTURES""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.СтруктурныйПродукт)
		|			ТОГДА ""INSTRUMENT_TYPE_SP""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Опцион)
		|			ТОГДА ""INSTRUMENT_TYPE_OPTION""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.КлиринговыйСертификат)
		|			ТОГДА ""INSTRUMENT_TYPE_CLEARING_CERTIFICATE""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Индекс)
		|			ТОГДА ""INSTRUMENT_TYPE_INDEX""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыИнструментов.Товар)
		|			ТОГДА ""INSTRUMENT_TYPE_COMMODITY""
		|		ИНАЧЕ ""INSTRUMENT_TYPE_UNSPECIFIED""
		|	КОНЕЦ КАК ТипИнструмента,
		|	Инструменты.Тикер КАК Тикер,
		|	Инструменты.Наименование КАК Наименование,
		|	Инструменты.classCode КАК classCode
		|ИЗ
		|	Справочник.Инструменты КАК Инструменты
		|ГДЕ
		|	Инструменты.UID = """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//РаботаСREST.TInvest_ОсновнаяИнформацияОбИнструменте();
		
		Данные = ms_РаботаСREST.TInvest_НайтиИнструмент(Выборка.Тикер, Выборка.ТипИнструмента);
		Если ЗначениеЗаполнено(Данные) и Данные.Свойство("instruments") Тогда
			Если Данные.instruments.Количество() > 1 Тогда
				
				НомерПозиции = ВыбратьПравильный(Данные.instruments, Выборка.Тикер);
				Если НомерПозиции <> Неопределено Тогда
					ДанныеИнструмента = Данные.instruments[НомерПозиции];
				Иначе
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По тикеру %1 нашли несколько инструментов, данные не заполнены", Выборка.Тикер), Выборка.Ссылка);
					Продолжить;
				КонецЕсли;
			ИначеЕсли Данные.instruments.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Не найден " + Выборка.Тикер, Выборка.Ссылка);
				Продолжить;
			КонецЕсли;
			ДанныеИнструмента = Данные.instruments[0];
			//ЗаполнитьРеквизитыИнструментаИзСтруктуры(ДанныеИнструмента);
			
			ИнструментОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ИнструментОбъект, ДанныеИнструмента);
			ИнструментОбъект.РазмерЛота = ДанныеИнструмента.lot;
			ИнструментОбъект.Тикер = ДанныеИнструмента.ticker;
			ИнструментОбъект.Наименование = ДанныеИнструмента.name;
			ИнструментОбъект.ТипИнструмента = ИнструментыБрокера.ТипИнструментаПоInstrumentType(ДанныеИнструмента.instrumentKind);
			//Если ДанныеИнструмента.instrumentType = "share" Тогда
			//	ИнструментОбъект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
			//Иначе
			//	Сообщить("нужно дописать заполнение типа инструмента");
			//	Продолжить;
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(ИнструментОбъект.Тикер) И 
				ЗначениеЗаполнено(ИнструментОбъект.classCode) И 
				Не ЗначениеЗаполнено(ИнструментОбъект.ВалютаНоминала) Тогда
				
				Данные = ms_РаботаСREST.TInvest_ОсновнаяИнформацияОбИнструменте(ИнструментОбъект.Тикер, ИнструментОбъект.classCode);
				
				Если ЗначениеЗаполнено(Данные) и Данные.Свойство("instrument") Тогда
					ДанныеИнструмента = Данные.instrument;
					ЗаполнитьЗначенияСвойств(ИнструментОбъект, ДанныеИнструмента);
					//ИнструментОбъект.РазмерЛота = ДанныеИнструмента.lot;
					//ИнструментОбъект.Наименование = ДанныеИнструмента.name;
					ИнструментОбъект.ВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию(ДанныеИнструмента.currency);
					//Если ДанныеИнструмента.instrumentType = "share" Тогда
					//	ИнструментОбъект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
					//КонецЕсли;
				КонецЕсли;

			КонецЕсли;
			
			ИнструментОбъект.Записать();
			
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не найден " + Выборка.Тикер, Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ПолучитьУИДы()

Функция ВыбратьПравильный(instruments, Тикер)
	
	Для НомерПозиции = 0 По instruments.Количество()-1 Цикл
		Если instruments[НомерПозиции].ticker = Тикер Тогда
			Возврат НомерПозиции;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
